somrthing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-25 二 16:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>somrthing</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">somrthing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3d5643d">1. 近期任务</a>
<ul>
<li><a href="#org41a1367">1.1. TSR拆解SSR</a>
<ul>
<li><a href="#org36609ef">1.1.1. Camera</a></li>
<li><a href="#orgbc643da">1.1.2. IMU</a></li>
<li><a href="#org442ee11">1.1.3. X9U内部通讯</a></li>
</ul>
</li>
<li><a href="#org17d9713">1.2. 9295E输出MIPI数据</a></li>
<li><a href="#org94e3032">1.3. reboot soc问题排查</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3d5643d" class="outline-2">
<h2 id="org3d5643d"><span class="section-number-2">1.</span> 近期任务</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org41a1367" class="outline-3">
<h3 id="org41a1367"><span class="section-number-3">1.1.</span> TSR拆解SSR</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org36609ef" class="outline-4">
<h4 id="org36609ef"><span class="section-number-4">1.1.1.</span> Camera</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgcde1556"></a>XH8_BSW_TSR_126<br />
<div class="outline-text-5" id="text-1-1-1-1">
<ul class="org-ul">
<li>确认正确开启内部功能安全机制</li>
<li>读取摄像头反馈的故障信息</li>
<li>正确上报应用层</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org8566bdb"></a>MAX96755<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<p>
共有33个功能安全机制
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ID</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Fault_to_be_detected</th>
<th scope="col" class="org-left">illustrate</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SM1</td>
<td class="org-left">BIST_for_Serial_Link(内置PRBS用于检查全双工穿行链路正/反向BER误码率)</td>
<td class="org-left">数据损坏-Video_Channel,Bit_Error_Rate,Link_Issues</td>
<td class="org-left">串化GEN,解串Check。需要写寄存器来开启检测</td>
</tr>

<tr>
<td class="org-left">SM2</td>
<td class="org-left">Line_fault_detection_on_Serializer_Output(检测到TX+/-的线路故障，问题标记于LFLTB引脚)</td>
<td class="org-left">穿行链路输出线路故障（对bat/地短路、开路）</td>
<td class="org-left">755_Pin32_LMN1连接到了SIOA,但是电阻NI（0x1A 0x1B 0x26 0x27）</td>
</tr>

<tr>
<td class="org-left">SM3</td>
<td class="org-left">CRC_for_Control_Channel(前向反向控制通道的CRC,16bit数据包CRC。UART/I2C/SPI/GPIO)</td>
<td class="org-left">控制通道上的数据损坏</td>
<td class="org-left">0xA0 0xF0</td>
</tr>

<tr>
<td class="org-left">SM4</td>
<td class="org-left">CRC_for_Control_Channal(32bit视频行CRC和16bit数据包CRC)</td>
<td class="org-left">前向视频通道的数据损坏</td>
<td class="org-left">0x50 0x54 0x54 0x5c 需要解串方也要开启，鉴于目前755方案我们应该决定不了</td>
</tr>

<tr>
<td class="org-left">SM5</td>
<td class="org-left">Error_Correction_through_Re-transmission_on_Control_Channel(控制信号在前向反向模式，最多可以纠正每个数据包16bit错误)</td>
<td class="org-left">出现1.错误的CRC2.丢弃额度packet的时候进行重传</td>
<td class="org-left">0x1C 0x1D 0x8E 0x8F 0xA6 0xA7 0xAE 0xAF</td>
</tr>

<tr>
<td class="org-left">SM6</td>
<td class="org-left">LOCK_indicator_of_Forward_Channel(出现时序错误或者解串侧没有锁定，拉高LOCK引脚)</td>
<td class="org-left">PLL Lock error、Timing errors</td>
<td class="org-left">755_Pin2_LOCK 电路已连，目前未实现相关控制检测</td>
</tr>

<tr>
<td class="org-left">SM7</td>
<td class="org-left">ERRB_indicator_of_Forward_Channel(出现CRC错误时，解串ERRB输出翻转)</td>
<td class="org-left">前向数据传输错误</td>
<td class="org-left">对解串提出的要求，鉴于目前方案无法实施</td>
</tr>

<tr>
<td class="org-left">SM8</td>
<td class="org-left">LOCK_indicator_of_Reverse_Channel(在反向通道连续模式出现timing错误时，LOCK pin拉高)</td>
<td class="org-left">PLL Lock error、Timing errors</td>
<td class="org-left">没看懂</td>
</tr>

<tr>
<td class="org-left">SM9</td>
<td class="org-left">ERRB_indicator_of_Reverse_Channel(ERRB引脚在反向数据传输错误时拉高)</td>
<td class="org-left">反向数据传输错误</td>
<td class="org-left">没找到对应寄存器相关内容</td>
</tr>

<tr>
<td class="org-left">SM10</td>
<td class="org-left">Error_generator(串行器侧故障注入发生器)</td>
<td class="org-left">CRC生成器错误</td>
<td class="org-left">0x29 0x2A 0x190</td>
</tr>

<tr>
<td class="org-left">SM11</td>
<td class="org-left">Video_Sequence_Number(一个交替的1bit视频数据包序列号来检测丢失的视频数据包并进行填充以维持连续性。错误将通过 CRC 进行标记。 该序列号对于控制通道也有效。)</td>
<td class="org-left">丢弃的视频/控制packet</td>
<td class="org-left">未找到明确相关寄存器</td>
</tr>

<tr>
<td class="org-left">SM12</td>
<td class="org-left">Acknowledge_of_UART_or_I2C</td>
<td class="org-left">节点故障</td>
<td class="org-left">ARQ0相关寄存器、0x8D</td>
</tr>

<tr>
<td class="org-left">SM13</td>
<td class="org-left">Watermark_Detector_and_Watermark_Generator(水印序列在串行器/解串器处生成，于解串器/串行器处评估)</td>
<td class="org-left">Frozen Frame冻结帧（介于生成端于检测端的）</td>
<td class="org-left">0x1C 0x1D 0x190 0x192 0x194 0x195 0x1AE 0x1AF</td>
</tr>

<tr>
<td class="org-left">SM14</td>
<td class="org-left">Eye_Opening_Monitor(测量链路余量，于误码率直接相关SM1)</td>
<td class="org-left">丢失lock、电缆信号完整性</td>
<td class="org-left">0x1C 0x1D 0x1404~0x1407 0x1434~0x143B</td>
</tr>

<tr>
<td class="org-left">SM15</td>
<td class="org-left">Overvoltage/Undervoltage(通过寄存器进行内部电压测量：VDD VDDIO VDD18 OV UV)</td>
<td class="org-left">报告过压、欠压状况</td>
<td class="org-left">0x1C 0x1D 0x56C 0x1458~0x1459</td>
</tr>

<tr>
<td class="org-left">SM16</td>
<td class="org-left">Evaluate_MIPI_ECC/CRC(评估MIPI ECC/CRC并设置相关寄存器)</td>
<td class="org-left">接受的图像数据损坏</td>
<td class="org-left">0x1F 0x3A0 0x3A2 0x389 0x399</td>
</tr>

<tr>
<td class="org-left">SM17</td>
<td class="org-left">FIFO_Overflow_Detection</td>
<td class="org-left">Over flow in frame buffer</td>
<td class="org-left">0x102 0x10A 0x112 0x11A</td>
</tr>

<tr>
<td class="org-left">SM18</td>
<td class="org-left">Register_Reading_for_Line_Fault/ERRB/LOCK_through_I2C/UART</td>
<td class="org-left">除引脚外，LFLT/ERRB/LOCK 的状态通过冗余寄存器读数进行验证</td>
<td class="org-left">LFLT:0x1A 0x1B ERRB:0x1f相关 LOCK:0x13</td>
</tr>

<tr>
<td class="org-left">SM19</td>
<td class="org-left">Packet_Counter_for_GPIO/I2C/SPI/UART_packets</td>
<td class="org-left">数据包计数</td>
<td class="org-left">0x23</td>
</tr>

<tr>
<td class="org-left">SM20</td>
<td class="org-left">9b/10b_illegal_symbol_check,running_disparity</td>
<td class="org-left">9b/10b解码器非法符号检查</td>
<td class="org-left">和解串相关</td>
</tr>

<tr>
<td class="org-left">SM21</td>
<td class="org-left">Clock_Monitor:150_MHz_clock_compared_against_crystal_clock,leading_to_LOCK_error</td>
<td class="org-left">150MHz时钟与晶振时钟进行比较</td>
<td class="org-left">未见相关寄存器</td>
</tr>

<tr>
<td class="org-left">SM22</td>
<td class="org-left">CRC_on_configuration_data_for_data_retention_memory</td>
<td class="org-left">保留存储器上的数据受CRC保护</td>
<td class="org-left">应该不用管</td>
</tr>

<tr>
<td class="org-left">SM23</td>
<td class="org-left">Start_Stop_Verification_on_I2C</td>
<td class="org-left">I2C总线有开始/结束确认</td>
<td class="org-left">应该不用管</td>
</tr>

<tr>
<td class="org-left">SM24</td>
<td class="org-left">Redunant_OTP_memory</td>
<td class="org-left">配置寄存器的OTP存储器，完全冗余</td>
<td class="org-left">不用管</td>
</tr>

<tr>
<td class="org-left">SM25</td>
<td class="org-left">Video_Detect</td>
<td class="org-left">当检测到有效视频信号，控制器进行确认</td>
<td class="org-left">0x102系列 0x380 0x390 0x55D~0x56A</td>
</tr>

<tr>
<td class="org-left">SM26</td>
<td class="org-left">PRBS_Synchronization_and_Validation</td>
<td class="org-left">既有PRBS同步也有验证</td>
<td class="org-left">0x29 0x1E5系列</td>
</tr>

<tr>
<td class="org-left">SM27</td>
<td class="org-left">Readback_of_status_register_informing_on_ARQ_retrials</td>
<td class="org-left">保存在状态寄存器内的ARQ重试次数</td>
<td class="org-left">ARQ系列寄存器</td>
</tr>

<tr>
<td class="org-left">SM28</td>
<td class="org-left">Dual_View_Memory_Integrity_Check</td>
<td class="org-left">比较读写数据差异，通过终端引脚报告错误</td>
<td class="org-left">不用管</td>
</tr>

<tr>
<td class="org-left">SM29</td>
<td class="org-left">Verification_of_info_Frame</td>
<td class="org-left">定期发送信息帧，并在接收端进行检查，CRC 受保护</td>
<td class="org-left">不知道</td>
</tr>

<tr>
<td class="org-left">SM30</td>
<td class="org-left">Overflow/Underflow_Detection_on_RGMII</td>
<td class="org-left">有RGMII溢出和下溢检测</td>
<td class="org-left">不用管</td>
</tr>

<tr>
<td class="org-left">SM31</td>
<td class="org-left">Video_Lock</td>
<td class="org-left">除了Link_LOCK之外还有Video_LOCK</td>
<td class="org-left">0x102系列</td>
</tr>

<tr>
<td class="org-left">SM32</td>
<td class="org-left">Readback_of_Logic_State_for_GPIO</td>
<td class="org-left">GPIO状态可通过I2C回读</td>
<td class="org-left">应该不用管</td>
</tr>

<tr>
<td class="org-left">SM33</td>
<td class="org-left">GPIO_open_detection</td>
<td class="org-left">通过内部上拉和下拉程序依次检测 GPIO 是否打开</td>
<td class="org-left">应该不用管</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org5b6263a"></a>MAX96722<br /></li>
</ol>
</li>
<li><a id="orgf399354"></a>XH8_BSW_TSR_127<br /></li>
<li><a id="org0e17232"></a>XH8_BSW_TSR_128<br /></li>
<li><a id="orgd3418f5"></a>XH8_BSW_TSR_129<br /></li>
<li><a id="orgba8898a"></a>XH8_BSW_TSR_130<br /></li>
</ol>
</div>
<div id="outline-container-orgbc643da" class="outline-4">
<h4 id="orgbc643da"><span class="section-number-4">1.1.2.</span> IMU</h4>
</div>
<div id="outline-container-org442ee11" class="outline-4">
<h4 id="org442ee11"><span class="section-number-4">1.1.3.</span> X9U内部通讯</h4>
</div>
</div>
<div id="outline-container-org17d9713" class="outline-3">
<h3 id="org17d9713"><span class="section-number-3">1.2.</span> 9295E输出MIPI数据</h3>
</div>
<div id="outline-container-org94e3032" class="outline-3">
<h3 id="org94e3032"><span class="section-number-3">1.3.</span> reboot soc问题排查</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-25 二 00:00</p>
<p class="date">Created: 2023-07-25 二 16:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
